In [2]:
import pandas as pd
import numpy as np

In [14]:
df = pd.read_csv("income.csv")

In [16]:
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [18]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [24]:
df.Income.quantile(0.25, interpolation='lower')

5000

In [30]:
#Using quantile to remove the outlier
percentile_99 = df.Income.quantile(0.99)
percentile_99

9400479.999999994

In [38]:
df_no_outlier = df[df.Income<=percentile_99]

In [40]:
df_no_outlier

    Name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [58]:
df['Income'][3] = np.NaN;

In [60]:
df

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [62]:
df.Income.mean()

1671666.6666666667

In [64]:
df_median = df.fillna(df.Income.median())

In [66]:
df_median

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0